To remove no longer used columns in Dataframe, and to focus only on the columns which are in use.

In [1]:
import pandas as pd

In [9]:
ufo=pd.read_csv('http://bit.ly/uforeports')

In [10]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [6]:
ufo.shape

(18241, 4)

In [11]:
ufo.drop('Colors Reported', axis=1, inplace=True) # Drop Individual columns

Axis is kind of direction, where axis =0 is Row and axis=1 is column. And yes i am sure to commit this changes to Dataframe(inplace=True).

In [12]:
ufo

                       City Shape Reported State              Time
0                    Ithaca       TRIANGLE    NY    6/1/1930 22:00
1               Willingboro          OTHER    NJ   6/30/1930 20:00
2                   Holyoke           OVAL    CO   2/15/1931 14:00
3                   Abilene           DISK    KS    6/1/1931 13:00
4      New York Worlds Fair          LIGHT    NY   4/18/1933 19:00
...                     ...            ...   ...               ...
18236            Grant Park       TRIANGLE    IL  12/31/2000 23:00
18237           Spirit Lake           DISK    IA  12/31/2000 23:00
18238           Eagle River            NaN    WI  12/31/2000 23:45
18239           Eagle River          LIGHT    WI  12/31/2000 23:45
18240                  Ybor           OVAL    FL  12/31/2000 23:59

[18241 rows x 4 columns]

In [13]:
ufo.drop(['City', 'State'], axis=1, inplace=True)# Drop multiple columns using python list

In [14]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

Above results say multiple columns are dropped.

###### Drop Rows instead of columns

Use Axis=0 which is for Rows in the above command, replace column name with row name.

In [15]:
ufo.drop([0,1], axis=0, inplace=True) #Row name are nothing but index, axis =0 is for Rows

In [16]:
ufo.head()

  Shape Reported             Time
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00
5           DISK  9/15/1934 15:30
6         CIRCLE   6/15/1935 0:00

In [17]:
ufo.shape

(18239, 2)

From the above results it shows that number of rows are decreased by 2. axis=0 is by default.